[
  {
    "id": "arine-staff-data-ops-2025",
    "title": "Staff Data Operations Engineer",
    "company": "Arine",
    "company_id": "arine",
    "location": "Remote, United States",
    "start_date": "2025-03",
    "end_date": null,
    "is_current": true,
    "employment_type": "full-time",
    "description": "Leading data operations and infrastructure for healthcare technology platform focused on medication management and clinical decision support. Responsible for data pipeline architecture, MLOps implementation, and ensuring HIPAA-compliant data processing workflows that support patient care optimization and clinical outcomes analysis.",
    "highlights": [
      "Leading data operations and infrastructure for healthcare technology platform focused on medication management and clinical decision support",
      "Responsible for data pipeline architecture, MLOps implementation, and ensuring HIPAA-compliant data processing workflows that support patient care optimization and clinical outcomes analysis"
    ],
    "technologies": ["MLOps", "HIPAA", "Data Pipelines"],
    "industries": ["Healthcare Technology"],
    "sort_order": 1
  },
  {
    "id": "modular-earth-principal-ai-architect-2022",
    "title": "Principal AI Architect and Engineer, Founder",
    "company": "Modular Earth",
    "company_id": "modular-earth",
    "location": "Buford, Georgia, United States",
    "start_date": "2022-12",
    "end_date": null,
    "is_current": true,
    "employment_type": "self-employed",
    "description": "Modular Earth is a not-for-profit organization that supports the free and open-source development of AI-driven applications for social good. Modular Earth's mission is to make wealth accessible to working-class people in an increasingly volatile job market. My active AI projects include a career assistant to help workers execute an effective go-to-market strategy and a financial assistant to help families save and invest their money. My principles maximize accessibility, privacy, trust, and creative control while minimizing cost. My software architectures enforce open-source, local-first, portable, and distributed design principles, often integrating emerging technologies such as AI and blockchain. My vision is to deploy AI-as-a-public-service in local libraries across the United States at no cost to individuals looking for work.",
    "highlights": [
      "Modular Earth is a not-for-profit organization that supports the free and open-source development of AI-driven applications for social good",
      "Active AI projects include a career assistant to help workers execute an effective go-to-market strategy and a financial assistant to help families save and invest their money",
      "Software architectures enforce open-source, local-first, portable, and distributed design principles, often integrating emerging technologies such as AI and blockchain",
      "Vision is to deploy AI-as-a-public-service in local libraries across the United States at no cost to individuals looking for work"
    ],
    "technologies": ["AI", "Blockchain", "Open Source"],
    "industries": ["Technology", "Social Impact"],
    "sort_order": 2
  },
  {
    "id": "hyperbloom-chief-ai-officer-2020",
    "title": "Chief AI Officer, Founder",
    "company": "Hyperbloom",
    "company_id": "hyperbloom",
    "location": "United States",
    "start_date": "2020-01",
    "end_date": null,
    "is_current": true,
    "employment_type": "self-employed",
    "description": "Hyperbloom is an IT services and consulting business that I own and operate. As the head of the organization, I: + Collaborate closely with other executives, founders, and business owners to define and execute effective go-to-market and product development strategies. + Design and deliver cloud-based AI and data solutions to many industries with a focus on healthcare, life science, and financial services. + Lead teams of sales coordinators, account managers, and solutions architects in executing the full sales cycle for our products and services. + Partner with research organizations, technology vendors, and other consulting companies. + Recruit mission-driven people who specialize in building emerging technology. + Support product developers as they incubate AI businesses in our community. + Train engineers and architects on how to be entrepreneurs and live the life they want to live. Teach them to target high-demand, low supply markets and develop multiple income streams while living a meaningful and fulfilling life. + Build decentralized, autonomous talent platforms and consulting infrastructure to support our mission to bring self-sovereignty to independent contractors and working-class entrepreneurs.",
    "highlights": [
      "Collaborate closely with other executives, founders, and business owners to define and execute effective go-to-market and product development strategies",
      "Design and deliver cloud-based AI and data solutions to many industries with a focus on healthcare, life science, and financial services",
      "Lead teams of sales coordinators, account managers, and solutions architects in executing the full sales cycle for our products and services",
      "Partner with research organizations, technology vendors, and other consulting companies",
      "Recruit mission-driven people who specialize in building emerging technology",
      "Support product developers as they incubate AI businesses in our community",
      "Train engineers and architects on how to be entrepreneurs and live the life they want to live",
      "Build decentralized, autonomous talent platforms and consulting infrastructure to support our mission to bring self-sovereignty to independent contractors and working-class entrepreneurs"
    ],
    "technologies": ["AI", "Cloud Computing", "Data Engineering"],
    "industries": ["IT Services and Consulting", "Healthcare", "Life Science", "Financial Services"],
    "sort_order": 3
  },
  {
    "id": "booz-allen-hamilton-chief-ai-architect-2024",
    "title": "Chief AI Architect, Senior Manager",
    "company": "Booz Allen Hamilton",
    "company_id": "booz-allen-hamilton",
    "location": "Atlanta, Georgia, United States",
    "start_date": "2024-07",
    "end_date": "2025-03",
    "is_current": false,
    "employment_type": "full-time",
    "description": "+ Led the development and operationalization of AI and analytics solutions, enabling clients to harness clinical, behavioral, and genomic data for advancements in population health, research, and predictive medicine. + Helped healthcare and life science clients realize the transformative potential of AI in medicine, while mitigating risks such as algorithmic bias and privacy breaches. + Stayed ahead of the rapidly evolving health sector curve by addressing clinical, regulatory, and technological needs with experience-based insights. + Collaborated with cross-functional teams to design, implement, and deploy AI software products tailored to the unique challenges and opportunities in the healthcare and life science industry. + Ensured the delivery of precise and practical AI solutions that drive meaningful outcomes for clients and contribute to advancing data-driven medicine.",
    "highlights": [
      "Led the development and operationalization of AI and analytics solutions, enabling clients to harness clinical, behavioral, and genomic data for advancements in population health, research, and predictive medicine",
      "Helped healthcare and life science clients realize the transformative potential of AI in medicine, while mitigating risks such as algorithmic bias and privacy breaches",
      "Stayed ahead of the rapidly evolving health sector curve by addressing clinical, regulatory, and technological needs with experience-based insights",
      "Collaborated with cross-functional teams to design, implement, and deploy AI software products tailored to the unique challenges and opportunities in the healthcare and life science industry",
      "Ensured the delivery of precise and practical AI solutions that drive meaningful outcomes for clients and contribute to advancing data-driven medicine"
    ],
    "technologies": ["AI", "Machine Learning", "Analytics", "Genomics"],
    "industries": ["Healthcare", "Life Science", "Government Consulting"],
    "sort_order": 4
  },
  {
    "id": "mento-executive-ai-coach-2023",
    "title": "Executive AI and Data Science Coach",
    "company": "Mento",
    "company_id": "mento",
    "location": "Buford, Georgia, United States",
    "start_date": "2023-09",
    "end_date": "2024-08",
    "is_current": false,
    "employment_type": "contract",
    "description": "+ Delivered a new, science-backed approach for coaching to the modern workforce. + Drove performance with a proprietary 80/20 approach to personalized 1-on-1 coaching and mentorship. + Built custom growth plans tailored to my client's unique goals and challenges. + 100% of my clients credited me for helping them be better leaders at work. + 93% of my clients reported an improvement in their work performance.",
    "highlights": [
      "Delivered a new, science-backed approach for coaching to the modern workforce",
      "Drove performance with a proprietary 80/20 approach to personalized 1-on-1 coaching and mentorship",
      "Built custom growth plans tailored to my client's unique goals and challenges",
      "100% of my clients credited me for helping them be better leaders at work",
      "93% of my clients reported an improvement in their work performance"
    ],
    "technologies": ["AI", "Data Science", "Coaching Platforms"],
    "industries": ["Professional Development", "Coaching"],
    "sort_order": 5
  },
  {
    "id": "trends-center-neuroinformatics-architect-2022",
    "title": "Neuroinformatics Data Platform Architect",
    "company": "TReNDS Center",
    "company_id": "trends-center",
    "location": "Atlanta, Georgia, United States",
    "start_date": "2022-01",
    "end_date": "2023-09",
    "is_current": false,
    "employment_type": "full-time",
    "description": "+ Tech lead and architect for COINSTAC, an open-source software suite designed to foster collaborative, decentralized research that applied multimodal fusion approaches to neuroimaging and genomics data. COINSTAC offered data anonymity through differential privacy algorithms, so members did not need to fear Personal Health Information (PHI) traceback. + Advised the leadership team on the product's feature roadmap, mission, and vision. + Worked closely with research scientists to develop advanced analytic approaches and neuroinformatics tools that leveraged advanced brain imaging and omics data to translate these approaches into biomarkers that helped address relevant areas of brain health and disease. + Focused on improving the team's communication and collaboration processes and tooling. + Acted as the team's Scrum master, defining and executing Agile frameworks. + Architected and managed the cloud components of the system in AWS. Made improvements to decouple the system and better leverage managed services. + Built-out GPU-focused compute infrastructure to support deep learning computations. + Supported the growth and commercialization of COINSTAC through user adoption efforts, open-source contributor recruitment, grant writing (like Small Business Innovation Research grants), and industry partnerships. + Contributed to technical whitepapers, documentation, and translational research in neuroscience and data science.",
    "highlights": [
      "Tech lead and architect for COINSTAC, an open-source software suite designed to foster collaborative, decentralized research that applied multimodal fusion approaches to neuroimaging and genomics data",
      "Advised the leadership team on the product's feature roadmap, mission, and vision",
      "Worked closely with research scientists to develop advanced analytic approaches and neuroinformatics tools that leveraged advanced brain imaging and omics data",
      "Focused on improving the team's communication and collaboration processes and tooling",
      "Acted as the team's Scrum master, defining and executing Agile frameworks",
      "Architected and managed the cloud components of the system in AWS",
      "Built-out GPU-focused compute infrastructure to support deep learning computations",
      "Supported the growth and commercialization of COINSTAC through user adoption efforts, open-source contributor recruitment, grant writing, and industry partnerships",
      "Contributed to technical whitepapers, documentation, and translational research in neuroscience and data science"
    ],
    "technologies": ["AWS", "GPU Computing", "Deep Learning", "Differential Privacy", "Neuroimaging", "Genomics", "Agile/Scrum"],
    "industries": ["Neuroscience Research", "Healthcare", "Life Science"],
    "sort_order": 6
  },
  {
    "id": "amazon-web-services-ai-ml-solutions-architect-2018",
    "title": "Enterprise AI and ML Solutions Architect",
    "company": "Amazon Web Services",
    "company_id": "amazon-web-services",
    "location": "Greater Atlanta Area",
    "start_date": "2018-08",
    "end_date": "2021-05",
    "is_current": false,
    "employment_type": "full-time",
    "description": "+ Worked with existing and potential customers to architect and integrate their applications and services with the AWS platform. + Provided prescriptive guidance, best practices, and assistance in designing applications and services that are secure, scalable, reliable, and performant. + Engaged nationally as a subject matter expert in artificial intelligence and machine learning. + Built deep relationships with executives and other leaders while assisting them with the definition and execution of technical and business strategies, including technical recruiting, go-to-market strategy, and cost management. + Authored publications such as technical white papers, presentations, and reference architectures. + Created proof of concepts and ran benchmarking experiments. + Acted as a technical liaison between customers and the web service teams to provide customer driven product improvement feedback. + Collaborated with professional services, training, and support teams to ensure customer success. + Partnered with the sales team to drive AWS adoption and revenue. + Plan, led, and spoke at private and public meetings and events with diverse groups of stakeholders daily. + Customers served: Cox Enterprises, Cox Communications, Cox Automotive (Autotrader, Dealer.com, Kelley Blue Book, Manheim, VinSolutions), Equifax, Jostens, NCR, D3, Accenture, Deloitte.",
    "highlights": [
      "Worked with existing and potential customers to architect and integrate their applications and services with the AWS platform",
      "Provided prescriptive guidance, best practices, and assistance in designing applications and services that are secure, scalable, reliable, and performant",
      "Engaged nationally as a subject matter expert in artificial intelligence and machine learning",
      "Built deep relationships with executives and other leaders while assisting them with the definition and execution of technical and business strategies",
      "Authored publications such as technical white papers, presentations, and reference architectures",
      "Created proof of concepts and ran benchmarking experiments",
      "Acted as a technical liaison between customers and the web service teams to provide customer driven product improvement feedback",
      "Collaborated with professional services, training, and support teams to ensure customer success",
      "Partnered with the sales team to drive AWS adoption and revenue",
      "Customers served: Cox Enterprises, Cox Communications, Cox Automotive, Equifax, Jostens, NCR, D3, Accenture, Deloitte"
    ],
    "technologies": ["AWS", "AI", "Machine Learning", "Cloud Architecture", "SageMaker"],
    "industries": ["Cloud Computing", "Technology"],
    "sort_order": 7
  },
  {
    "id": "neurolex-labs-senior-ai-engineer-2018",
    "title": "Senior AI Engineer",
    "company": "NeuroLex Labs",
    "company_id": "neurolex-labs",
    "location": "Greater Atlanta Area",
    "start_date": "2018-01",
    "end_date": "2020-05",
    "is_current": false,
    "employment_type": "full-time",
    "description": "+ Architected and developed software applications, web services, and data pipelines that made voice computing accessible to everyone. + Designed automated machine learning workflows that collect data, clean data, train models, and deploy models. These systems primarily process text and audio data. + Worked with executive leadership, researchers, and customers to design new features and products that delighted users, had a great technical foundation, were easy to support, and delivered on the key performance metrics and goals of the business. + Collaborated weekly with a highly distributed, cross-functional team. + Assured quality through test-driven development. I advocated for, and drove the implementation of, regression, functional, load, and integration testing. + Primary contributor to our technical documentation. I wrote robust documentation that all levels of engineers and scientists could understand. + Mentored members of our Tribe, a fellowship program where outstanding students and researchers from around the world came together to discover new applications for the prediction and prevention of neurodegenerative diseases. + Evangelized the company and recruited new team members.",
    "highlights": [
      "Architected and developed software applications, web services, and data pipelines that made voice computing accessible to everyone",
      "Designed automated machine learning workflows that collect data, clean data, train models, and deploy models",
      "Worked with executive leadership, researchers, and customers to design new features and products",
      "Collaborated weekly with a highly distributed, cross-functional team",
      "Assured quality through test-driven development with regression, functional, load, and integration testing",
      "Primary contributor to technical documentation",
      "Mentored members of the Tribe fellowship program for prediction and prevention of neurodegenerative diseases",
      "Evangelized the company and recruited new team members"
    ],
    "technologies": ["Machine Learning", "NLP", "Audio Processing", "Data Pipelines", "TDD"],
    "industries": ["Healthcare AI", "Voice Computing"],
    "sort_order": 8
  },
  {
    "id": "decooda-senior-ai-solutions-architect-2018",
    "title": "Senior AI Solutions Architect",
    "company": "Decooda",
    "company_id": "decooda",
    "location": "Greater Atlanta Area",
    "start_date": "2018-01",
    "end_date": "2018-08",
    "is_current": false,
    "employment_type": "full-time",
    "description": "+ Architected AI solutions that detect and predict human behavior. These solutions were cloud-first and built to scale with a focus on unstructured data. + Designed next generation data science tools for the customer experience industry. I pioneered new products and features by bridging customer feedback back into product development. + Led client service delivery operations for our engineering and data science teams. I established processes and tooling to improve the efficiency and effectiveness of the organization. + Acted as the technical lead and project manager on client-facing projects. + Managed diverse teams of data scientists, software engineers, and customer experience experts as we delivered quality solutions on aggressive timelines. + Executed multiple agile software development and data science process life cycles in tandem. + Took ownership of any gaps in my team's abilities, acting in a variety of roles including software engineer, data engineer, data scientist, and data storyteller. I did everything from building web services to presenting research results. + Automated everything I possibly could, from analytics reports to the development and deployment of our software applications. + Supported the sales cycle by contributing to statements of work, responding to requests for proposals, and building demos. + Engaged weekly in the recruiting and hiring process. + Inspired a culture of radical transparency with a passion for people. + Clients served: Principal, FLEETCOR, Veloxiti.",
    "highlights": [
      "Architected AI solutions that detect and predict human behavior, cloud-first and built to scale with a focus on unstructured data",
      "Designed next generation data science tools for the customer experience industry",
      "Led client service delivery operations for engineering and data science teams",
      "Acted as the technical lead and project manager on client-facing projects",
      "Managed diverse teams of data scientists, software engineers, and customer experience experts",
      "Executed multiple agile software development and data science process life cycles in tandem",
      "Automated analytics reports and development/deployment of software applications",
      "Supported the sales cycle with statements of work, RFP responses, and demos",
      "Clients served: Principal, FLEETCOR, Veloxiti"
    ],
    "technologies": ["AI", "Cloud Computing", "Data Science", "Agile"],
    "industries": ["AI", "Customer Experience Analytics"],
    "sort_order": 9
  },
  {
    "id": "slalom-consulting-advanced-analytics-consultant-2015",
    "title": "Advanced Analytics Consultant",
    "company": "Slalom Consulting",
    "company_id": "slalom-consulting",
    "location": "Greater Atlanta Area",
    "start_date": "2015-07",
    "end_date": "2018-01",
    "is_current": false,
    "employment_type": "full-time",
    "description": "+ Advised client leadership on analytics strategy. + Designed, architected, and developed intelligent software applications across a variety of tech stacks and cloud platforms. + Performed data engineering tasks in direct collaboration with data scientists. I acquired, transferred, stored, explored, and prepared data. + Operationalized data science experiments and data science teams. I took work that was done in local, isolated environments and transferred it to cloud-based production systems that provided support for seamless collaboration and automation. + Delivered technical documentation, presentations, and training to diverse audiences spanning executive leadership, nurses, behavioral staff, software developers, and business analysts. + Grew the artificial intelligence business by developing workshops, creating marketing materials, and supporting the sales process. + Known as a technical expert in the Microsoft ecosystem, more specifically in .NET, Microsoft Azure, and the Cortana Intelligence Suite. + Known as a domain expert in public sector, healthcare, digital marketing, and artificial intelligence. + Recognized nationally as a subject matter expert in natural language processing and machine learning. + Appreciated regularly by colleagues during the performance review process for expressing a positive attitude, keeping attention to detail, and maintaining effective communication.",
    "highlights": [
      "Advised client leadership on analytics strategy",
      "Designed, architected, and developed intelligent software applications across a variety of tech stacks and cloud platforms",
      "Performed data engineering tasks in direct collaboration with data scientists",
      "Operationalized data science experiments and data science teams into cloud-based production systems",
      "Delivered technical documentation, presentations, and training to diverse audiences",
      "Grew the artificial intelligence business by developing workshops, creating marketing materials, and supporting the sales process",
      "Known as a technical expert in the Microsoft ecosystem (.NET, Microsoft Azure, Cortana Intelligence Suite)",
      "Known as a domain expert in public sector, healthcare, digital marketing, and artificial intelligence",
      "Recognized nationally as a subject matter expert in natural language processing and machine learning"
    ],
    "technologies": [".NET", "Microsoft Azure", "Cortana Intelligence Suite", "NLP", "Machine Learning"],
    "industries": ["Technology Consulting", "Healthcare", "Public Sector", "Digital Marketing"],
    "sort_order": 10
  },
  {
    "id": "red-ventures-software-engineer-2014",
    "title": "Software Engineer",
    "company": "Red Ventures",
    "company_id": "red-ventures",
    "location": "Fort Mill, South Carolina",
    "start_date": "2014-03",
    "end_date": "2015-07",
    "is_current": false,
    "employment_type": "full-time",
    "description": "+ Took ownership of the entire direct marketing process for large brands in high-growth industries. Using web technology, I optimized the entire customer acquisition process, from demand generation to closing the sale. + Engineered full-stack web applications primarily on the LAMP stack. I held responsibilities across every aspect of our software development and data management life cycles. + Developed and maintained multiple proprietary applications including a web framework, a content management system, an experience management platform, hundreds of high-traffic consumer-facing websites, a sales management system, a business intelligence reporting framework, and various API implementations. + Partnered closely with analysts to drive the daily performance of key sales metrics and marketing assets. + Maintained rapid iterations of our agile software development life cycle to hit aggressive deadlines. + Clients served: DirecTV, Vonage, ADT, Verizon, Boost Mobile, HughesNet, AT&T, Frontier Communications, CenturyLink, Safeco Insurance, ASI, Liberty Mutual, Progressive, The Hartford, Travelers, MetLife, Foremost Insurance Group.",
    "highlights": [
      "Took ownership of the entire direct marketing process for large brands in high-growth industries",
      "Engineered full-stack web applications primarily on the LAMP stack",
      "Developed and maintained multiple proprietary applications including a web framework, CMS, experience management platform, and hundreds of high-traffic consumer-facing websites",
      "Partnered closely with analysts to drive the daily performance of key sales metrics and marketing assets",
      "Maintained rapid iterations of agile software development life cycle",
      "Clients served: DirecTV, Vonage, ADT, Verizon, Boost Mobile, HughesNet, AT&T, Frontier Communications, CenturyLink, Safeco Insurance, ASI, Liberty Mutual, Progressive, The Hartford, Travelers, MetLife, Foremost Insurance Group"
    ],
    "technologies": ["LAMP Stack", "PHP", "MySQL", "JavaScript", "HTML", "CSS", "API Development"],
    "industries": ["Digital Marketing", "Technology"],
    "sort_order": 11
  },
  {
    "id": "microsoft-senior-support-engineer-2012",
    "title": "Senior Support Engineer",
    "company": "Microsoft",
    "company_id": "microsoft",
    "location": "Charlotte, North Carolina Area",
    "start_date": "2012-07",
    "end_date": "2014-03",
    "is_current": false,
    "employment_type": "full-time",
    "description": "+ Supported the full systems development life cycle of hundreds of high business impact web applications, web services, and server farms in environments with tens of thousands of users. + Recognized as a subject matter expert in SharePoint, Microsoft's leading social content management system and collaborative knowledge discovery platform. + Acted as the primary contact where I delivered advanced technical troubleshooting support and problem resolution to Fortune 100 customers. High-level managers and top-tier IT administrators turned to me as a last resort after exploiting all of their resources. I was most often requested to assist during critical situations such as deployments, upgrades, installations of hotfixes, migrations, restorations, and to recover from a substantial loss in business functionality. + Demonstrated consistent success collaborating with international teams on projects that involved dozens of stakeholders. + Planned for and improved solutions regarding server farm performance, disaster recovery and availability, and infrastructure capacity. + Created functional design specifications, requirements documents, implementation plans, and governance plans. + Wrote PowerShell and C# scripts using several .NET object models to automate tasks such as the assembly, deployment, and testing of web applications and their infrastructure. + Known for providing excellent internal case documentation and written customer communication. + Graduate of the Microsoft Academy for College Hires (MACH Program). + Nominated for Global Business Support's \"Entrepreneur of the Year\" in 2013. + Clients served: Chevron, Shell, Walmart, Deloitte, Hewlett Packard, Intel, State of Virginia, Department of Defense, FBI, Disney, Bank of America, Endo Health Solutions, General Dynamics, IGT, VHA, Yum! Brands, Chrylser, Canon, Grainger, Nielsen, BlueCross BlueShield, IMF, Woodforest National Bank, Lockheed Martin, FSU, Siemens, SanMar, Teck, AmerisourceBergin, IATA.",
    "highlights": [
      "Supported the full systems development life cycle of hundreds of high business impact web applications, web services, and server farms",
      "Recognized as a subject matter expert in SharePoint",
      "Delivered advanced technical troubleshooting support and problem resolution to Fortune 100 customers",
      "Demonstrated consistent success collaborating with international teams on projects with dozens of stakeholders",
      "Planned for and improved solutions regarding server farm performance, disaster recovery, and infrastructure capacity",
      "Wrote PowerShell and C# scripts using .NET object models to automate tasks",
      "Graduate of the Microsoft Academy for College Hires (MACH Program)",
      "Nominated for Global Business Support's Entrepreneur of the Year in 2013",
      "Clients served: Chevron, Shell, Walmart, Deloitte, HP, Intel, DoD, FBI, Disney, Bank of America, and many more"
    ],
    "technologies": ["SharePoint", "PowerShell", "C#", ".NET", "Windows Server"],
    "industries": ["Technology", "Enterprise Software"],
    "sort_order": 12
  },
  {
    "id": "paul-prae-digital-strategy-consultant-2010",
    "title": "Digital Strategy Consultant, Web Developer",
    "company": "Paul Prae",
    "company_id": "paul-prae-consulting",
    "location": "South East United States",
    "start_date": "2010-01",
    "end_date": "2012-07",
    "is_current": false,
    "employment_type": "self-employed",
    "description": "+ Helped entrepreneurs and early-stage companies realize their vision through digital marketing. + Designed, built, and hosted websites. + Acted as a technical lead during the development of web applications. + Recruited and managed teams of engineers and analysts with diverse skill sets.",
    "highlights": [
      "Helped entrepreneurs and early-stage companies realize their vision through digital marketing",
      "Designed, built, and hosted websites",
      "Acted as a technical lead during the development of web applications",
      "Recruited and managed teams of engineers and analysts with diverse skill sets"
    ],
    "technologies": ["Web Development", "Digital Marketing", "Web Hosting"],
    "industries": ["Digital Marketing", "Web Development"],
    "sort_order": 13
  },
  {
    "id": "paul-prae-music-producer-2005",
    "title": "Music Producer, Audio Engineer",
    "company": "Paul Prae",
    "company_id": "paul-prae-music",
    "location": "South East United States",
    "start_date": "2005-02",
    "end_date": "2012-07",
    "is_current": false,
    "employment_type": "self-employed",
    "description": "+ Produced, taught, and performed in various multimedia studio projects. + Engineered the stage and the front-of-house sound during live shows of up to 750 attendees. + Coordinated production duties, such as live sound, video, lighting, and photography for stage crews. + Venues served: New Earth Music Hall, John Keane Studios, WUOG Radio Station, The Rialto Club, O' Reilly Audio Services, The 40 Watt Club, The University of Georgia, The Melting Point, Monolith Studio, White Ship Records, Nuci's Space. + Artists server: Widespread Panic, Bonobo, Shpongle, Modern Skirts, Drive-By Truckers, DubConscious, The Glitch Mob, Damon Moon and the Whispering Drifters, Christopher Cross, Edwin McCain, Shawn Mullins, Corey Smith, Toro y Moi, Eliot Lipp, Pigs on the Wing, J. Cole, Lotus, Yelawolf, Nappy Roots, Emancipator, John Keane, Toubab Krewe, Pac Div, The New Mastersounds, Afroman, Beats Antique, Dumpstaphunk, The Polish Ambassador, PANTyRAiD, JJ Grey & Mofro, Perpetual Groove, Lera Lynn.",
    "highlights": [
      "Produced, taught, and performed in various multimedia studio projects",
      "Engineered the stage and the front-of-house sound during live shows of up to 750 attendees",
      "Coordinated production duties, such as live sound, video, lighting, and photography for stage crews",
      "Venues served: New Earth Music Hall, John Keane Studios, WUOG Radio Station, The Rialto Club, The 40 Watt Club, The University of Georgia, The Melting Point, and more",
      "Artists served: Widespread Panic, Bonobo, Shpongle, Drive-By Truckers, The Glitch Mob, J. Cole, Lotus, Yelawolf, and many more"
    ],
    "technologies": ["Pro Tools", "Live Sound Engineering", "Audio Production"],
    "industries": ["Music Production", "Audio Engineering"],
    "sort_order": 14
  },
  {
    "id": "john-keane-studios-engineering-intern-2009",
    "title": "Engineering Intern",
    "company": "John Keane Studios",
    "company_id": "john-keane-studios",
    "location": "Athens, GA",
    "start_date": "2009-08",
    "end_date": "2010-05",
    "is_current": false,
    "employment_type": "internship",
    "description": "+ Assisted in audio engineering assignments as needed throughout recording sessions. + Led the teaching assistants for the Pro Tools lab at the University of Georgia. + Shadowed Grammy-nominated producer John Keane as he engineered, mixed, mastered, and produced the album Dirty Side Down by Widespread Panic.",
    "highlights": [
      "Assisted in audio engineering assignments as needed throughout recording sessions",
      "Led the teaching assistants for the Pro Tools lab at the University of Georgia",
      "Shadowed Grammy-nominated producer John Keane as he engineered, mixed, mastered, and produced the album Dirty Side Down by Widespread Panic"
    ],
    "technologies": ["Pro Tools", "Audio Engineering", "Studio Recording"],
    "industries": ["Music", "Recording Studio"],
    "sort_order": 15
  },
  {
    "id": "damon-moon-production-manager-2009",
    "title": "Production Manager for the Summer Tour",
    "company": "Damon Moon and the Whispering Drifters",
    "company_id": "damon-moon-and-the-whispering-drifters",
    "location": "The United States of America",
    "start_date": "2009-06",
    "end_date": "2009-08",
    "is_current": false,
    "employment_type": "contract",
    "description": "+ Coordinated all production duties, such as live sound, video, lighting, and photography.",
    "highlights": [
      "Coordinated all production duties, such as live sound, video, lighting, and photography"
    ],
    "technologies": ["Live Sound", "Video Production", "Lighting"],
    "industries": ["Music", "Performing Arts"],
    "sort_order": 16
  }
]
