[
  {
    "id": "hyperbloom",
    "title": "Hyperbloom",
    "description": "Grew to $1.4M ARR business with just a $40k investment",
    "url": "https://www.hyperbloom.ai/",
    "start_date": "2020-01",
    "end_date": null,
    "status": "active",
    "technologies": ["AI", "Cloud Computing", "Data Engineering"],
    "outcomes": ["$1.4M ARR with $40k investment"],
    "position_id": "hyperbloom-chief-ai-officer-2020",
    "project_type": "business"
  },
  {
    "id": "modular-earth",
    "title": "Modular Earth",
    "description": "Not-for-profit organization supporting free and open-source development of AI-driven applications for social good. Mission is to make wealth accessible to working-class people in an increasingly volatile job market.",
    "url": "https://github.com/Modular-Earth-LLC",
    "start_date": "2022-12",
    "end_date": null,
    "status": "active",
    "technologies": ["AI", "Blockchain", "Open Source"],
    "outcomes": [],
    "position_id": "modular-earth-principal-ai-architect-2022",
    "project_type": "nonprofit"
  },
  {
    "id": "career-coach-ai-assistant",
    "title": "Career Coach and Digital Marketing AI Assistant",
    "description": "A career coach and digital marketing assistant designed to help job seekers create personalized go-to-market strategies and outreach content for building professional networks and securing job opportunities. The assistant crafts tailored connection requests and introductory messages by analyzing company needs.",
    "url": null,
    "start_date": "2024-01",
    "end_date": null,
    "status": "active",
    "technologies": ["AI", "LLM", "NLP"],
    "outcomes": [],
    "position_id": "modular-earth-principal-ai-architect-2022",
    "project_type": "open-source"
  },
  {
    "id": "financial-ai-assistant",
    "title": "Financial AI Assistant for Working-Class Families",
    "description": "This GitHub repository features an AI-driven personal financial assistant focused on budgeting, debt management, savings, and investment planning. It offers tailored financial advice and analyzes financial documents to provide actionable insights, making it ideal for users who need financial guidance or are interested in economic data analysis.",
    "url": null,
    "start_date": "2024-01",
    "end_date": null,
    "status": "active",
    "technologies": ["AI", "LLM", "Financial Analysis"],
    "outcomes": [],
    "position_id": "modular-earth-principal-ai-architect-2022",
    "project_type": "open-source"
  },
  {
    "id": "open-source-local-first-ai-stack",
    "title": "My Open Source and Local-First AI Tech Stack",
    "description": "I am building an AI agent/app to help people develop a career strategy and apply for jobs. I'm obsessed with open source, self-hosted, local first, multi-agent workflows. The tech stack is centered around libraries like Ollama, LangChain, n8n, and Neo4j. I use Rust and TypeScript as my programming languages. I'm focused on getting people off big tech cloud providers for benefits related to cost, privacy, security, intellectual property, control, and simplicity. The only hosting providers I plan on using are highly principled companies like Hugging Face, Mistral.ai, Together.ai, and Storj.io when local computing or storage doesn't fit the use case. The app doesn't need an internet connection, so I focus on local desktop apps for Mac, Windows, and Linux. I specialize in local-first app frameworks like Tauri, so I never have to deploy this app to multi-tier cloud environments, which lets me keep it hella simple and private/secure.",
    "url": null,
    "start_date": "2024-01",
    "end_date": null,
    "status": "active",
    "technologies": ["Ollama", "LangChain", "n8n", "Neo4j", "Rust", "TypeScript", "Tauri"],
    "outcomes": [],
    "position_id": "modular-earth-principal-ai-architect-2022",
    "project_type": "open-source"
  },
  {
    "id": "coinstac-neuroinformatics-platform",
    "title": "COINSTAC: Neuroinformatics Data Platform",
    "description": "An open-source software suite that fosters collaborative research using neuroimaging and genomics data. It removes large barriers to traditional data-centric collaboration approaches. It enables groups of users to run common analyses on their own machines over their own datasets with ease. The results of these analyses are synchronized to the cloud, and undergo aggregate analyses processes using all contributor data. Decentralized pipelines allow for distributed, iterative, and feature rich analyses to be run, opening new and exciting capabilities for collaborative computation. It also offers data anonymity through differential privacy algorithms, so members do not need to fear PHI traceback.",
    "url": "http://coinstac.org",
    "start_date": "2022-01",
    "end_date": null,
    "status": "active",
    "technologies": ["AWS", "Differential Privacy", "Neuroimaging", "Genomics", "Decentralized Computing"],
    "outcomes": ["Published in Frontiers in Neuroinformatics", "Supported federated analysis across research institutions"],
    "position_id": "trends-center-neuroinformatics-architect-2022",
    "project_type": "research"
  },
  {
    "id": "blockchain-life-science-data-platform",
    "title": "Blockchain-Based Data Platform Architecture for Managing Life Science Data",
    "description": "Applied blockchain technology to securely and privately exchange data. We designed a system to facilitate and verify a data lifecycle using smart contracts. The lifecycle identified, tracked, and secured data with event logging in place. We designed it to meet global regulatory requirements, data protection laws (CCPA, GDPR, and HIPAA), and privacy frameworks (like FAIR). We made sure it was interoperable by applying standards such as CDISC, SDTM, ADaM, and HL7.",
    "url": null,
    "start_date": "2022-06",
    "end_date": "2022-10",
    "status": "completed",
    "technologies": ["Blockchain", "Smart Contracts", "HIPAA", "GDPR", "HL7"],
    "outcomes": ["Met global regulatory requirements including CCPA, GDPR, and HIPAA"],
    "position_id": "hyperbloom-chief-ai-officer-2020",
    "project_type": "consulting"
  },
  {
    "id": "disaster-recovery-clinical-trials",
    "title": "Disaster Recovery Planning and Data Protection Solution Architecture for Clinical Trials",
    "description": "Architected disaster recovery solutions and governed data for clinical trial software that helped more than 10,000 research sites in 45 countries manage their documents, data, and workflows. The platform also provides remote access so sponsors and contract research organizations (CROs) can collaborate with their sites around the world. The platform's users performed 5.5 million remote monitoring activities each month.",
    "url": null,
    "start_date": "2022-06",
    "end_date": "2022-12",
    "status": "completed",
    "technologies": ["Cloud Computing", "Disaster Recovery", "Data Governance"],
    "outcomes": ["Supported 10,000+ research sites in 45 countries", "Platform handled 5.5 million remote monitoring activities monthly"],
    "position_id": "hyperbloom-chief-ai-officer-2020",
    "project_type": "consulting"
  },
  {
    "id": "genomics-data-lake",
    "title": "Genomics Data Lake",
    "description": "A genomics client of ours was operating entirely on-premises. Data was being stored locally on SAN disks and analytics were performed via Jupyter Hub hosted on their over-utilized HPCs. We wrote and deployed a software agent on their HPCs as a file gateway, allowing them to essentially mount a file storage system with low latency access to their newly created S3 buckets. Since the amount of data they had to move at the start was not too large, they requested for us to implement a site-to-site VPN for data transfer to save costs. We used AWS Glue to transform the data into a columnar format, Parquet, as it was optimized for the type of queries they planned to execute. To save both time and money, a transformation must occur when the technician attempts to query the data. To facilitate this, when the query is ran, a CloudWatch event is fired that causes AWS Glue to transform the VCF files into Parquet and save them into another S3 bucket in their Data Lake. The AWS Glue Data Catalog was then updated to reflect these changes. Overall, we successfully implemented a production-ready start to their data lake and automated several tasks for their data engineers.",
    "url": "https://www.hyperbloom.ai/",
    "start_date": "2021-06",
    "end_date": "2021-11",
    "status": "completed",
    "technologies": ["AWS", "S3", "AWS Glue", "CloudWatch", "Parquet", "VPN", "Genomics"],
    "outcomes": ["Successfully implemented production-ready data lake", "Automated data engineering tasks"],
    "position_id": "hyperbloom-chief-ai-officer-2020",
    "project_type": "consulting"
  },
  {
    "id": "neurolex-voice-computing",
    "title": "NeuroLex: Voice Computing for Healthcare",
    "description": "We architected and developed multiple software applications, web services, and data pipelines, supporting our mission to make voice computing accessible to everyone. The automated machine learning workflows we built collected data, cleaned data, trained models, and deployed models.",
    "url": "https://www.neurolex.ai",
    "start_date": "2018-01",
    "end_date": "2020-05",
    "status": "completed",
    "technologies": ["Machine Learning", "NLP", "Audio Processing", "Data Pipelines"],
    "outcomes": ["Built automated ML workflows for voice data processing"],
    "position_id": "neurolex-labs-senior-ai-engineer-2018",
    "project_type": "product"
  },
  {
    "id": "microservices-web-crawling",
    "title": "Microservices for Web Crawling and Scraping",
    "description": "Using Python and Kafka, I built a series of highly scalable microservices that could extract data from almost any popular news site. This unstructured data was then cleaned so it could be easily consumed by our text analytics platform. This system allowed our clients to follow industry trends and gain insights about both their customers and competitors. For Principal, the data was piped into an engine that predicted earnings surprise and will eventually influence investment decisions.",
    "url": null,
    "start_date": "2018-02",
    "end_date": "2018-05",
    "status": "completed",
    "technologies": ["Python", "Apache Kafka", "Microservices", "NLP", "Web Scraping"],
    "outcomes": ["Enabled clients to follow industry trends", "Predicted earnings surprise for Principal"],
    "position_id": "decooda-senior-ai-solutions-architect-2018",
    "project_type": "consulting"
  },
  {
    "id": "knowledge-transfer-module",
    "title": "Knowledge Transfer Module",
    "description": "Designed, architected, and developed a system that creates high-quality training data at enterprise scale. It helps train, test, and tune machine learning algorithms for everything from search relevance and sentiment analysis to conversational agents. By annotating data with this system, business analysts were able to contribute to our knowledge base and improve the quality of predictions made by Decooda's machine learning classifiers. The application was built with React, Express, and Node.js.",
    "url": "https://www.paulprae.com/natural-language-processing-systems/",
    "start_date": "2018-01",
    "end_date": "2018-08",
    "status": "completed",
    "technologies": ["React", "Express", "Node.js", "Machine Learning", "NLP"],
    "outcomes": ["Created enterprise-scale training data system", "Improved ML classifier quality"],
    "position_id": "decooda-senior-ai-solutions-architect-2018",
    "project_type": "product"
  },
  {
    "id": "azure-vs-lex-bot-assessment",
    "title": "Solution Assessment Comparing the Azure Bot Service to Amazon Lex for a Fortune 100 Insurance Company",
    "description": "In order to properly compare the Microsoft bot ecosystem to that of Amazon's, I designed an identical conversational interface for both. The purpose of the bots was to automate common IT support tasks. Though the flow of the conversation was the same for both bots, the back-end implementation was completely different. I led the conversational interface design for the entire project and the development of the Amazon Lex bot. Along the way, I also delivered learning sessions to their team about the bot development life cycle.",
    "url": null,
    "start_date": "2017-07",
    "end_date": "2017-08",
    "status": "completed",
    "technologies": ["Azure Bot Service", "Amazon Lex", "Conversational AI"],
    "outcomes": ["Delivered comparative assessment for Fortune 100 insurance company"],
    "position_id": "slalom-consulting-advanced-analytics-consultant-2015",
    "project_type": "consulting"
  },
  {
    "id": "demand-forecasting-healthcare",
    "title": "Demand Forecasting of Healthcare Services",
    "description": "In order to reduce costs, optimize staffing, and support the budgeting process, we predicted demand for behavioral health crisis services in dozens of facilities across the state of Georgia. I led the data engineering and data storytelling parts of the project. I integrated data into a data warehouse from several previously siloed systems. While performing our analysis for this project, we also helped the organization improve their data governance and data science process.",
    "url": null,
    "start_date": "2017-08",
    "end_date": "2018-01",
    "status": "completed",
    "technologies": ["Data Warehousing", "Predictive Analytics", "Data Engineering"],
    "outcomes": ["Predicted demand for behavioral health crisis services across Georgia", "Integrated siloed data systems into data warehouse"],
    "position_id": "slalom-consulting-advanced-analytics-consultant-2015",
    "project_type": "consulting"
  },
  {
    "id": "behavioral-healthcare-review-app",
    "title": "Behavioral Healthcare Service Review Application",
    "description": "Built a Universal Windows Platform app using XAML, C#, Prism, SQLite, and Azure Mobile Services and an accompanying web app using ASP.NET, Knockout.js, Bootstrap, and Power BI. I led the front-end development of both applications. The purpose of these apps is to provide nurses and behavioral staff an easy way to collect data so they can improve the quality of care patients are receiving. This data is then exposed to leadership to support strategy and operations. The project brought in over two million dollars in revenue.",
    "url": null,
    "start_date": "2015-07",
    "end_date": "2018-01",
    "status": "completed",
    "technologies": ["XAML", "C#", "Prism", "SQLite", "Azure Mobile Services", "ASP.NET", "Knockout.js", "Bootstrap", "Power BI"],
    "outcomes": ["Brought in over $2M in revenue", "Improved quality of care for behavioral health patients"],
    "position_id": "slalom-consulting-advanced-analytics-consultant-2015",
    "project_type": "consulting"
  },
  {
    "id": "widespread-panic-dirty-side-down",
    "title": "Widespread Panic Album Production: Dirty Side Down",
    "description": "Shadowed Grammy-nominated producer John Keane as he engineered, mixed, mastered, and produced the album. Prepared studio for recording sessions including microphone placement and guitar rigging. Setup, configured, and repaired musical instruments and equipment. Made the band comfortable.",
    "url": "http://en.wikipedia.org/wiki/Dirty_Side_Down",
    "start_date": "2010-01",
    "end_date": "2010-05",
    "status": "completed",
    "technologies": ["Pro Tools", "Studio Recording", "Audio Engineering"],
    "outcomes": ["Contributed to Widespread Panic album Dirty Side Down"],
    "position_id": "john-keane-studios-engineering-intern-2009",
    "project_type": "creative"
  },
  {
    "id": "charlotte-startup-weekend-fitbloc",
    "title": "Charlotte Startup Weekend Six: Team 'FitBloc'",
    "description": "For the Sixth Charlotte Startup Weekend my team came up with the business model and wireframe behind FitBloc. The two original team members were skilled, driven, and full of energy. As the visionary, Ryan Cates pitched the idea. His passion, and the development background behind his partner, sold me immediately. The first problem we addressed: health information is increasingly difficult for the fitness community to navigate. The second problem: fitness professionals do not have a single tool-set for online marketing and branding. FitBloc is an online platform that brings the right information and resources to the right people when they need it.",
    "url": "http://bit.ly/1lkVLwd",
    "start_date": "2014-01",
    "end_date": "2014-01",
    "status": "completed",
    "technologies": ["Web Development", "UX Design"],
    "outcomes": ["Developed business model and wireframe for FitBloc platform"],
    "position_id": null,
    "project_type": "hackathon"
  },
  {
    "id": "logo-designs-workfoo",
    "title": "Logo Designs for Workfoo",
    "description": "A set of logos we designed for a startup named Workfoo. Workfoo Description - The primary goal behind Workfoo is to get work done. Workfoo facilitates the creation and realization of ideas. Workfoo Slogan - Are you ready for a new economy? A freelance meritocracy is inevitable. Workfoo Mission - 100% Employment.",
    "url": "https://www.behance.net/gallery/16783423/Logo-Designs-for-Workfoo",
    "start_date": "2010-07",
    "end_date": "2010-09",
    "status": "completed",
    "technologies": ["Graphic Design"],
    "outcomes": ["Delivered logo designs for startup"],
    "position_id": "paul-prae-digital-strategy-consultant-2010",
    "project_type": "creative"
  },
  {
    "id": "workfoo",
    "title": "Workfoo (backend is now FatFractal)",
    "description": "My main task was to help build a web application that set out to facilitate: Making it trivially easy to find work and get paid. Building a support network for advancing an individual's skills and career through recommendations and experiences that are merit based. Creating a professional freelance network that uses open source tools and its people to collaboratively get work done. Building a perfect team that self-organizes around the technology. Providing shrink-wrapped terms and conditions that ensure trustful and low-risk transactions. My contributions to the company depended on the current priorities. These varied among tasks such as development prioritizing, designing the user interface, testing the software, creating marketing communications, branding, building a team, designing a profit model, partnering with the college scene, and more.",
    "url": "http://fatfractal.com/",
    "start_date": "2010-01",
    "end_date": "2011-03",
    "status": "completed",
    "technologies": ["Web Development", "UI Design"],
    "outcomes": ["Built freelance network platform"],
    "position_id": "paul-prae-digital-strategy-consultant-2010",
    "project_type": "startup"
  },
  {
    "id": "hci-tempus-fugit",
    "title": "Human Computer Interaction Course Project: Tempus Fugit",
    "description": "I took this class my Senior year in College. Human Computer Interaction is one of my favorite research areas and is still central to the work I do today. During the semester we primarily focused on one project: evaluate some computing-related task/problem, develop interface design alternatives for the task/problem, implement a prototype of your design, evaluate your design. The theme for this semester's projects was: Connecting to (*) You - exploring how technological innovation can help an individual become the person they want to be.",
    "url": "http://www.behance.net/gallery/Coursework-Human-Computer-Interaction/13666849",
    "start_date": "2011-01",
    "end_date": "2011-04",
    "status": "completed",
    "technologies": ["HCI", "Prototyping", "User Research"],
    "outcomes": ["Completed HCI course project with user evaluation"],
    "position_id": null,
    "project_type": "academic"
  },
  {
    "id": "echurchgive-tithing-app",
    "title": "eChurchGive Tithing Application",
    "description": "Led team as the project manager, designing and executing on all aspects of the application development life cycle. Collecting constant feedback from stakeholders, we developed daily iterations of an iOS application and a mobile web application. Built the web application with jQuery, Knockout.js, and FatFractal's NoServer. Contributed code to the native iPhone application.",
    "url": "https://www.behance.net/gallery/eChurchGive-Mobile-Tithing-App/13677687",
    "start_date": "2012-05",
    "end_date": "2012-07",
    "status": "completed",
    "technologies": ["jQuery", "Knockout.js", "FatFractal", "iOS", "Mobile Web"],
    "outcomes": ["Delivered iOS and mobile web tithing application"],
    "position_id": "paul-prae-digital-strategy-consultant-2010",
    "project_type": "consulting"
  },
  {
    "id": "student-studio-online",
    "title": "Student Studio Online",
    "description": "Architected a JavaScript-centric web application using Node.js, MongoDB, and Angular.js. Built several iterations of a project-based learning and content management system. Student Studio is building a solution that is out to help urban youth develop literacy, math, and science skills through music production and business development.",
    "url": "http://mystudentstudio.com/",
    "start_date": "2013-03",
    "end_date": "2013-08",
    "status": "completed",
    "technologies": ["Node.js", "MongoDB", "Angular.js", "Drupal", "Moodle"],
    "outcomes": ["Built project-based learning platform for urban youth"],
    "position_id": null,
    "project_type": "social-impact"
  },
  {
    "id": "hackathon-clt-htcodelivery",
    "title": "HACKATHON clt: Team HTCoDelivery",
    "description": "First place submission for the Code category for HACKATHON clt. Engineered a Meteor application for a crowdsourced delivery system for Harris Teeter customers. Provided a data-backed business launch plan by implementing a map-reduce algorithm in combination with a k-means implementation to determine neighborhoods of most active shoppers. Processed 140+ million rows of purchase data using Apache Spark.",
    "url": "https://github.com/praeducer/htcodelivery",
    "start_date": "2015-03",
    "end_date": "2015-03",
    "status": "completed",
    "technologies": ["Meteor", "Apache Spark", "MapReduce", "K-Means"],
    "outcomes": ["First place in Code category", "Processed 140M+ rows of purchase data"],
    "position_id": null,
    "project_type": "hackathon"
  },
  {
    "id": "ibm-watson-hackathon",
    "title": "IBM Watson Hackathon",
    "description": "We'd like to get out a little more, intellectually speaking. To make that happen, we wanted to show Red Ventures the value of cognitive computing by performing research at IBM's Watson Hackathon. We aimed to augment and optimize conversations between customers and sales professionals using natural language processing and the Watson Developer Cloud. More specifically, we set out to explore chat data and dig up insights.",
    "url": "https://www.behance.net/gallery/27290319/IBM-Watson-Hackathon",
    "start_date": "2015-05",
    "end_date": "2015-05",
    "status": "completed",
    "technologies": ["IBM Watson", "NLP", "Cognitive Computing"],
    "outcomes": ["Demonstrated value of cognitive computing for sales optimization"],
    "position_id": "red-ventures-software-engineer-2014",
    "project_type": "hackathon"
  },
  {
    "id": "predicting-film-roi",
    "title": "Predicting the Features of a Film that Maximize ROI",
    "description": "For a course titled, \"Big Data Analytics For Competitive Advantage\", we researched trends in the film industry and applied predictive analytics to determine which types of movies would yield the highest return on investment. We performed web mining, data processing, data analysis, and data visualization to make our final prediction. We used technologies like Python, R, Excel, and SAS in our work.",
    "url": "https://github.com/praeducer/big-data-analytics-for-competitive-advantage",
    "start_date": "2015-01",
    "end_date": "2015-05",
    "status": "completed",
    "technologies": ["Python", "R", "Excel", "SAS", "Web Mining"],
    "outcomes": ["Applied predictive analytics to film industry ROI"],
    "position_id": null,
    "project_type": "academic"
  },
  {
    "id": "intro-azure-machine-learning",
    "title": "An Introduction to Azure Machine Learning",
    "description": "In this talk, we presented an overview of Azure Machine Learning, a fully managed cloud service that enables you to easily build, deploy, and share predictive analytics solutions. We started with the basics of machine learning and ended with a demo that used real world data.",
    "url": "http://www.slideshare.net/PaulPrae/introduction-to-azure-machine-learning-60479597",
    "start_date": "2016-03",
    "end_date": "2016-05",
    "status": "completed",
    "technologies": ["Azure Machine Learning", "Predictive Analytics"],
    "outcomes": ["Delivered public presentation on Azure ML"],
    "position_id": "slalom-consulting-advanced-analytics-consultant-2015",
    "project_type": "presentation"
  },
  {
    "id": "predicting-future-azure-ml",
    "title": "Predicting the Future with Azure Machine Learning",
    "description": "In this talk, I focus on supervised learning, a machine learning technique for performing predictive analytics. After introducing some vocabulary, I discuss the relationship between predictive analytics and machine learning. Next, I describe how you could use a classifier, such as a decision tree, to predict which passengers survived the sinking of the Titanic. Once the machine learning process is clear, I then talk about how Azure Machine Learning is an end-to-end data science solution. Finally, I demo an experiment that predicts the outcomes of patients who went through substance abuse treatment.",
    "url": "http://www.slideshare.net/PaulPrae/predicting-the-future-with-azure-machine-learning",
    "start_date": "2016-04",
    "end_date": "2016-06",
    "status": "completed",
    "technologies": ["Azure Machine Learning", "Supervised Learning", "Decision Trees"],
    "outcomes": ["Delivered presentation on supervised learning and Azure ML"],
    "position_id": "slalom-consulting-advanced-analytics-consultant-2015",
    "project_type": "presentation"
  },
  {
    "id": "ai-everywhere-microsoft-democratizing-ai",
    "title": "AI Everywhere: How Microsoft is Democratizing AI",
    "description": "Microsoft has set a goal of democratizing AI, making it accessible and valuable to everyone. They're focused on building an AI stack spanning infrastructure, services, apps and agents. In this presentation, we learn how Microsoft's intelligent cloud solutions can help any organization become more proactive and differentiate themselves from intensifying competition. We will discuss: Microsoft's AI Strategy, Examples of AI in the Enterprise, The Cortana Intelligence Suite.",
    "url": "http://www.slideshare.net/PaulPrae/ai-everywhere-how-microsoft-is-democratizing-ai-lightning-version",
    "start_date": "2016-10",
    "end_date": "2016-12",
    "status": "completed",
    "technologies": ["Microsoft AI", "Cortana Intelligence Suite", "Azure"],
    "outcomes": ["Delivered presentation on Microsoft AI strategy"],
    "position_id": "slalom-consulting-advanced-analytics-consultant-2015",
    "project_type": "presentation"
  },
  {
    "id": "azure-chatbot-service",
    "title": "Azure as a Chatbot Service: From Purpose To Production With A Cloud Bot Architecture",
    "description": "The tooling for building chatbots has exploded. Putting chatbots into production is now easier than ever. In this presentation, I focus on how you can use Azure Bot Service, Azure Search, and DocumentDB to create a scalable backend for your chatbot. By using a fully managed, serverless architecture with continuous deployment, you can get your chatbot up and running quickly.",
    "url": "http://www.slideshare.net/PaulPrae/azure-as-a-chatbot-service-from-purpose-to-production-with-a-cloud-bot-architecture",
    "start_date": "2017-01",
    "end_date": "2017-04",
    "status": "completed",
    "technologies": ["Azure Bot Service", "Azure Search", "DocumentDB", "Serverless"],
    "outcomes": ["Delivered presentation on cloud bot architecture"],
    "position_id": "slalom-consulting-advanced-analytics-consultant-2015",
    "project_type": "presentation"
  },
  {
    "id": "neona-chatbot",
    "title": "Neona: A Chatbot for Learning AI",
    "description": "Neona is a chat bot that helps people understand artificial intelligence. By interacting with her, you can explore concepts from across the field of artificial intelligence. By studying her design and architecture, you can learn how to build conversational agents.",
    "url": "http://www.neona.chat/",
    "start_date": "2016-10",
    "end_date": "2020-12",
    "status": "completed",
    "technologies": ["Conversational AI", "Chatbot", "NLP"],
    "outcomes": ["Built educational chatbot for learning AI concepts"],
    "position_id": null,
    "project_type": "side-project"
  }
]
