[
  {
    "id": "coinstac-vaults-federated-analysis",
    "name": "Enhancing collaborative neuroimaging research: introducing COINSTAC Vaults for federated analysis and reproducibility",
    "publisher": "Frontiers in Neuroinformatics",
    "published_date": "2023-06",
    "url": "https://www.frontiersin.org/journals/neuroinformatics/articles/10.3389/fninf.2023.1207721/full",
    "description": "Collaborative neuroimaging research is often hindered by technological, policy, administrative, and methodological barriers, despite the abundance of available data. COINSTAC (The Collaborative Informatics and Neuroimaging Suite Toolkit for Anonymous Computation) is a platform that successfully tackles these challenges through federated analysis, allowing researchers to analyze datasets without publicly sharing their data. This paper presents a significant enhancement to the COINSTAC platform: COINSTAC Vaults (CVs). CVs are designed to further reduce barriers by hosting standardized, persistent, and highly-available datasets, while seamlessly integrating with COINSTAC's federated analysis capabilities. CVs offer a user-friendly interface for self-service analysis, streamlining collaboration, and eliminating the need for manual coordination with data owners. Importantly, CVs can also be used in conjunction with open data as well, by simply creating a CV hosting the open data one would like to include in the analysis, thus filling an important gap in the data sharing ecosystem. We demonstrate the impact of CVs through several functional and structural neuroimaging studies utilizing federated analysis showcasing their potential to improve the reproducibility of research and increase sample sizes in neuroimaging studies."
  },
  {
    "id": "papers-on-cognitive-science",
    "name": "Papers On Cognitive Science",
    "publisher": "University of Georgia",
    "published_date": "2012",
    "url": "https://uga.academia.edu/PaulPrae",
    "description": "A series of papers I wrote in pursuit of my Bachelor of Arts in Cognitive Science with a Focused Foundation in Artificial Intelligence (http://www.ai.uga.edu/) at The University of Georgia (http://www.uga.edu/)."
  }
]
