[
  {
    "id": "all-tech-is-human-mentor",
    "organization": "All Tech Is Human",
    "role": "Mentor - AI Ethics",
    "cause": "humanRights",
    "start_date": "2023-05",
    "end_date": "2024-05",
    "description": "All Tech Is Human brings together people, organizations, and ideas to tackle wicked tech & society issues and co-create a tech future aligned with the public interest. Our activities grow and strengthen the Responsible Tech ecosystem, which speeds up society's ability to consider the impacts of technology, leads to greater multistakeholder collaboration, and diversifies the backgrounds and disciplines involved in the process."
  },
  {
    "id": "aiaaic-advisor",
    "organization": "AIAAIC",
    "role": "Advisor - IT Strategy",
    "cause": "civilRights",
    "start_date": "2023-06",
    "end_date": "2025-05",
    "description": "AIAAIC (AI, Algorithmic, and Automation Incidents and Controversies) is an independent, non-partisan, public interest initiative that examines and makes the case for real AI, algorithmic, and automation transparency and openness. We believe that AI, algorithms, and automation, and the organisations and individuals involved in their design, development, and deployment, must be transparent, open, and honest about their aims and how they go about pursuing them."
  },
  {
    "id": "first-mentor",
    "organization": "FIRST",
    "role": "Mentor",
    "cause": "scienceAndTechnology",
    "start_date": "2013-09",
    "end_date": "2015-08",
    "description": "Realized the vision of a world where every student has the opportunity to be inspired by the excitement of hands-on STEM learning and knows the feeling of creating something with technology. Assisted team members with writing code to control robots in C++, Java, and Robot C. Provided assistance with the design and construction of the robots."
  },
  {
    "id": "nucis-space-volunteer",
    "organization": "Nuci's Space",
    "role": "Volunteer",
    "cause": "socialServices",
    "start_date": "2008-08",
    "end_date": "2012-08",
    "description": "I have done many things for them over the years. As a general volunteer: I advocated mental health issues through implementation of campus and community-wide events to raise awareness of emotional health and the associated stigma. I designed and participated in fundraising events whose proceeds provided physical and mental health-care to uninsured musicians. As a production manager, sound engineer, lighting engineer, and stage manager: I produced quality shows for 25-150 attendees. I setup all of the sound and musical equipment for the artists. I mixed the stage and front-of-house sound. I organized the performance throughout the evenings. I managed the volunteer staff. As a booking agent and promoter: I planed, acquired staff, booked the artists, and marketed for benefit concerts."
  },
  {
    "id": "wuog-radio-staff",
    "organization": "WUOG 90.5 fm",
    "role": "Operations and Local Music Staff",
    "cause": "artsAndCulture",
    "start_date": "2008-08",
    "end_date": "2009-05",
    "description": "Prepared and ran equipment for the studio and live shows. Reviewed work of local artists and connected with the local music scene."
  },
  {
    "id": "russell-library-assistant",
    "organization": "Russell Library for Political Research and Studies",
    "role": "Access and Outreach Assistant",
    "cause": "civilRights",
    "start_date": "2008-06",
    "end_date": "2008-12",
    "description": "Proponent of the library's goal to increase education in areas such as civil and political rights. Provided web development for the library's website while updating and organizing their database of digital records."
  }
]
