[
  {
    "category": "achievement",
    "title": "Example: Revenue Impact from AI Platform",
    "content": "Led development of an AI-powered recommendation engine that increased customer retention by 15%, translating to $2.3M annual revenue impact. Built on AWS SageMaker with custom feature engineering pipeline processing 50M+ daily events.",
    "tags": ["ai", "aws", "revenue-impact", "machine-learning"],
    "relatedPositions": ["Example Company"]
  },
  {
    "category": "domain-expertise",
    "title": "Example: Healthcare AI Regulatory Knowledge",
    "content": "Deep expertise in HIPAA-compliant ML pipelines, FDA Software as a Medical Device (SaMD) guidelines, and CMS interoperability rules. Designed data governance frameworks adopted across three healthcare organizations.",
    "tags": ["healthcare", "compliance", "hipaa", "architecture"],
    "relatedPositions": ["Example Healthcare Co"]
  },
  {
    "category": "project-detail",
    "title": "Example: Real-Time ML Inference Platform",
    "content": "Architected a real-time ML inference platform serving 10,000+ predictions/second with p99 latency under 50ms. Used Kubernetes, Istio service mesh, and custom model serving framework. Reduced infrastructure costs by 40% compared to previous batch-processing approach.",
    "tags": ["infrastructure", "kubernetes", "ml-ops", "performance"],
    "relatedPositions": ["Example Tech Co"]
  },
  {
    "category": "leadership",
    "title": "Example: Engineering Team Growth",
    "content": "Grew AI engineering team from 3 to 12 engineers over 18 months. Established technical interview process, mentorship program, and architecture review board. Team achieved 95% sprint velocity consistency and zero critical production incidents for 6 consecutive months.",
    "tags": ["leadership", "hiring", "team-building", "management"],
    "relatedPositions": ["Example Company"]
  },
  {
    "category": "metric",
    "title": "Example: Pipeline Reliability Improvement",
    "content": "Reduced data pipeline failures from 12% to under 1% by implementing idempotent processing, dead-letter queues, and automated retry with exponential backoff. Saved 20+ engineering hours per week previously spent on manual intervention.",
    "tags": ["data-engineering", "reliability", "automation"],
    "relatedPositions": ["Example Data Co"]
  }
]
